InformationRegisters/Renault_ОкружениеРабочегоЛиста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ОкружениеРабочегоЛиста</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>IDK</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ОкружениеРабочегоЛиста/Ext/ManagerModule.bsl
Процедура ОбновитьОсновногоКлиентаОкруженияРабочегоЛиста(РабочийЛист, КлиентРабочегоЛиста) Экспорт
	
	Набор = РегистрыСведений.Renault_ОкружениеРабочегоЛиста.СоздатьНаборЗаписей();
	Набор.Отбор.IDK.Установить(РабочийЛист);
	Набор.Отбор.Основной.Установить(Истина);
	Набор.Прочитать();
	Если Набор.Количество() > 0 Тогда
		Статус = Набор[0].Статус;
	КонецЕсли;
	Набор.Очистить();
	Запись = Набор.Добавить();
	Запись.IDK = РабочийЛист;
	Запись.Основной = Истина;
	Запись.Клиент = КлиентРабочегоЛиста;
	Запись.Статус = Статус;
	Набор.Записать();

КонецПроцедуры
